In [1]:
import pandas as pd
import numpy as np

1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [3]:
df.FlightNumber=df.FlightNumber.fillna(0)

In [4]:
for i in range(4):
        
        if (df['FlightNumber']).iloc[i] == 0:
            df['FlightNumber'].iloc[i]=df['FlightNumber'].iloc[i-1]+10

C:\Users\aksha.LAPTOP-KKEAULMJ\Anaconda3\lib\site-packages\pandas\core\indexing.py:194: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._setitem_with_indexer(indexer, value)

In [150]:
df.head()

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)         10045      LoNDon_paris      [23, 47]
1    <Air France> (12)         10055      MAdrid_miLAN            []
2  (British Airways. )         10065  londON_StockhOlm  [24, 43, 87]
3       12. Air France         10075    Budapest_PaRis          [13]
4          "Swiss Air"         10085   Brussels_londOn      [67, 32]

In [6]:
df.FlightNumber=df.FlightNumber.astype('int')

In [7]:
df.dtypes

Airline         object
FlightNumber     int32
From_To         object
RecentDelays    object
dtype: object

Q2.The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame

In [12]:
df1=df.copy()

y=df1['From_To'].str.split('_').str[0]
df1['destination']=df1['From_To'].apply(lambda x: x.split('_')[1] )
df1['source']=y

df1.head()

,Airline,FlightNumber,From_To,RecentDelays,destination,source
0,KLM(!),10045,LoNDon_paris,"[23, 47]",paris,LoNDon
1,<Air France> (12),10055,MAdrid_miLAN,[],miLAN,MAdrid
2,(British Airways. ),10065,londON_StockhOlm,"[24, 43, 87]",StockhOlm,londON
3,12. Air France,10075,Budapest_PaRis,[13],PaRis,Budapest
4,"""Swiss Air""",10085,Brussels_londOn,"[67, 32]",londOn,Brussels

In [14]:
3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)


df1['source']=df1['source'].str.capitalize()

In [15]:
df1['destination']=df1['destination'].apply(lambda x: x[0].upper()+x[1:])

In [16]:
df1.head()

,Airline,FlightNumber,From_To,RecentDelays,destination,source
0,KLM(!),10045,LoNDon_paris,"[23, 47]",Paris,London
1,<Air France> (12),10055,MAdrid_miLAN,[],MiLAN,Madrid
2,(British Airways. ),10065,londON_StockhOlm,"[24, 43, 87]",StockhOlm,London
3,12. Air France,10075,Budapest_PaRis,[13],PaRis,Budapest
4,"""Swiss Air""",10085,Brussels_londOn,"[67, 32]",LondOn,Brussels

4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [17]:
df.drop('From_To',axis=1,inplace=True)

In [18]:
df.head()

               Airline  FlightNumber  RecentDelays
0               KLM(!)         10045      [23, 47]
1    <Air France> (12)         10055            []
2  (British Airways. )         10065  [24, 43, 87]
3       12. Air France         10075          [13]
4          "Swiss Air"         10085      [67, 32]

In [19]:
df=pd.concat([df,df1],axis=1)

In [20]:
df.head(2)

,Airline,FlightNumber,RecentDelays,Airline,FlightNumber,From_To,RecentDelays,destination,source
0,KLM(!),10045,"[23, 47]",KLM(!),10045,LoNDon_paris,"[23, 47]",Paris,London
1,<Air France> (12),10055,[],<Air France> (12),10055,MAdrid_miLAN,[],MiLAN,Madrid

5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each
second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.

In [211]:
type(df1['RecentDelays'].iloc[0])

list

In [21]:
def get_first(x):
    for i in x:
        if (i!=np.NaN):
            return i

In [22]:
df['delay1']=df1['RecentDelays'].apply(lambda x: get_first(x))

In [54]:
df.reset_index(drop=True)

,Airline,FlightNumber,RecentDelays,Airline,FlightNumber,From_To,RecentDelays,destination,source,delay1
0,KLM(!),10045,"[23, 47]",KLM(!),10045,LoNDon_paris,"[23, 47]",Paris,London,23.0
1,<Air France> (12),10055,[],<Air France> (12),10055,MAdrid_miLAN,[],MiLAN,Madrid,NaN
2,(British Airways. ),10065,"[24, 43, 87]",(British Airways. ),10065,londON_StockhOlm,"[24, 43, 87]",StockhOlm,London,24.0
3,12. Air France,10075,[13],12. Air France,10075,Budapest_PaRis,[13],PaRis,Budapest,13.0
4,"""Swiss Air""",10085,"[67, 32]","""Swiss Air""",10085,Brussels_londOn,"[67, 32]",LondOn,Brussels,67.0

In [74]:
def second(x):
    for i in range(0,2):
        if i==1:
            return x[i]

In [75]:
df1['RecentDelays'].apply(lambda x: second(x))

IndexError: list index out of range